In [1]:
!ls

CONTRIBUTING.md                 project_outline.txt
LICENSE.md                      student.ipynb
README.md                       text.txt
awesome.gif                     the_movie_database_filtered.csv
data_exploration.ipynb          the_movies_db_api.ipynb
movie_data_erd.jpeg             zippedData

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
bom_df = pd.read_csv('./zippedData/bom.movie_gross.csv.gz')
bom_df.tail()

In [ ]:
bom_df.isna().sum()

In [ ]:
bom_df.domestic_gross.describe()

In [ ]:
fig, ax = plt.subplots()



bom_df.boxplot(ax=ax)



plt.show()

In [7]:
# will need genre_ids decoder
tmdb_df = pd.read_csv('./zippedData/tmdb.movies.csv.gz')
tmdb_df.sort_values(by='vote_count', ascending=False)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
17383,17383,"[28, 12, 35]",293660,en,Deadpool,35.067,2016-02-12,Deadpool,7.6,20175
5179,5179,"[878, 28, 12]",24428,en,The Avengers,50.289,2012-05-04,The Avengers,7.6,19673
6,6,"[28, 12, 14, 878]",19995,en,Avatar,26.526,2009-12-18,Avatar,7.4,18676
11032,11032,"[12, 18, 878]",157336,en,Interstellar,28.440,2014-11-05,Interstellar,8.2,18597
...,...,...,...,...,...,...,...,...,...,...
14071,14071,[],312155,en,Merely Players,0.600,2014-12-16,Merely Players,3.0,1
14075,14075,[],287781,en,24 Hours,0.600,2014-07-25,24 Hours,3.0,1
14078,14078,[27],274257,en,The First Wave,0.600,2014-01-10,The First Wave,3.0,1
14087,14087,[35],365539,en,Cinema Purgatorio,0.600,2014-06-01,Cinema Purgatorio,2.5,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [ ]:
tmdb_df.isna().sum()

In [ ]:
tn_df = pd.read_csv('./zippedData/tn.movie_budgets.csv.gz')
tn_df.tail()

In [ ]:
tn_df.isna().sum()

In [ ]:
rtm_df = pd.read_csv('./zippedData/rt.movie_info.tsv.gz', delimiter='\t')
rtm_df.tail()

In [ ]:
rtm_df.isna().sum()

In [ ]:
rtr_df = pd.read_csv('./zippedData/rt.reviews.tsv.gz', delimiter='\t', encoding = "ISO-8859-1")
rtr_df.tail()

In [ ]:
rtr_df.info()

In [4]:
tmdb_df = pd.read_csv('./the_movie_database_filtered.csv')
tmdb_df.head()

,Unnamed: 0,budget,genres,id,imdb_id,original_title,release_date,revenue,vote_average,vote_count
0,0,250000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",12444.0,tt0926084,Harry Potter and the Deathly Hallows: Part 1,2010-10-17,954305868.0,7.8,16170.0
1,1,165000000.0,"[{'id': 14, 'name': 'Fantasy'}, {'id': 12, 'na...",10191.0,tt0892769,How to Train Your Dragon,2010-03-18,494878759.0,7.8,11036.0
2,2,200000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",10138.0,tt1228705,Iron Man 2,2010-04-28,623933331.0,6.8,18118.0
3,3,30000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",862.0,tt0114709,Toy Story,1995-10-30,373554033.0,8.0,15570.0
4,4,160000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 878, 'na...",27205.0,tt1375666,Inception,2010-07-15,825532764.0,8.4,31837.0